---
kind: other
id: Properties.T:Autodesk.Revit.DB.GlobalParametersManager
source: html/f21a1d41-f5c6-5653-9bde-87d9262c78f3.htm
---
# GlobalParametersManager Properties

Specifies whether the .NET object represents a valid Revit entity.